       01 REGISTER.
           03 REG-AGENCY               PICTURE X(03).
           03 REG-ACCOUNT              PICTURE X(06).
           03 REG-NAME                 PICTURE X(15).
           03 REG-MANAGER              PICTURE 9(03).
           03 REG-ACCTYPE              PICTURE 9(01).
           03 REG-BALANCE              PICTURE 9(6).
           